In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv('lpg_price_for_metropolitan.csv')

In [3]:
data.head()

      city        date    rate
0  Chennai  2017-06-01  434.00
1  Chennai  2017-08-01  464.00
2  Chennai  2017-09-01  468.50
3  Chennai  2017-10-01  470.00
4  Chennai  2018-06-01  481.84

In [4]:
data.tail()

       city        date   rate
163  Mumbai  2021-08-01  834.5
164  Mumbai  2021-08-18  859.5
165  Mumbai  2021-09-01  884.5
166  Mumbai  2021-10-01  910.5
167  Mumbai  2021-10-06  899.5

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 168 entries, 0 to 167
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    168 non-null    object
 1   date    168 non-null    object
 2   rate    168 non-null    float64
dtypes: float64(1), object(2)
memory usage: 4.1+ KB

In [6]:
data.describe()

             rate
count  168.000000
mean   627.420238
std    164.637910
min     60.000000
25%    492.505000
50%    566.750000
75%    794.000000
max    926.000000

In [7]:
data.isnull

<bound method DataFrame.isnull of         city        date    rate
0    Chennai  2017-06-01  434.00
1    Chennai  2017-08-01  464.00
2    Chennai  2017-09-01  468.50
3    Chennai  2017-10-01  470.00
4    Chennai  2018-06-01  481.84
..       ...         ...     ...
163   Mumbai  2021-08-01  834.50
164   Mumbai  2021-08-18  859.50
165   Mumbai  2021-09-01  884.50
166   Mumbai  2021-10-01  910.50
167   Mumbai  2021-10-06  899.50

[168 rows x 3 columns]>

In [8]:
data.city

0      Chennai
1      Chennai
2      Chennai
3      Chennai
4      Chennai
        ...
163     Mumbai
164     Mumbai
165     Mumbai
166     Mumbai
167     Mumbai
Name: city, Length: 168, dtype: object

In [9]:
pd.value_counts(data.city)

Delhi      44
Mumbai     44
Chennai    40
Kolkata    40
Name: city, dtype: int64

In [10]:
pd.value_counts(data.date)

2019-06-01    5
2021-02-04    5
2017-06-01    4
2020-01-01    4
2020-03-01    4
2017-08-01    4
2020-05-01    4
2020-06-01    4
2020-07-01    4
2021-01-01    4
2021-02-15    4
2021-02-25    4
2021-04-01    4
2021-05-01    4
2021-07-01    4
2021-08-01    4
2021-08-18    4
2021-09-01    4
2021-10-06    4
2020-02-12    4
2020-04-01    4
2019-12-01    4
2018-11-01    4
2017-09-01    4
2017-10-01    4
2018-06-01    4
2018-07-01    4
2018-08-01    4
2019-11-01    4
2018-10-01    4
2018-09-01    4
2018-12-01    4
2019-01-01    4
2019-02-01    4
2019-03-01    4
2019-04-01    4
2019-05-01    4
2019-07-01    4
2021-10-01    3
2017-07-01    3
2017-04-01    2
2017-05-01    2
2020-09-01    1
2017-01-01    1
2018-04-01    1
2017-12-01    1
Name: date, dtype: int64

In [11]:
data['date'].unique()

array(['2017-06-01', '2017-08-01', '2017-09-01', '2017-10-01',
       '2018-06-01', '2018-07-01', '2018-08-01', '2018-09-01',
       '2018-10-01', '2018-11-01', '2018-12-01', '2019-01-01',
       '2019-02-01', '2019-03-01', '2019-04-01', '2019-05-01',
       '2019-06-01', '2019-07-01', '2019-11-01', '2019-12-01',
       '2020-01-01', '2020-02-12', '2020-03-01', '2020-04-01',
       '2020-05-01', '2020-06-01', '2020-07-01', '2020-09-01',
       '2021-01-01', '2021-02-04', '2021-02-15', '2021-02-25',
       '2021-04-01', '2021-05-01', '2021-07-01', '2021-08-01',
       '2021-08-18', '2021-09-01', '2021-10-01', '2021-10-06',
       '2017-01-01', '2017-04-01', '2017-05-01', '2017-07-01',
       '2018-04-01', '2017-12-01'], dtype=object)

In [12]:
data['rate'].unique()

array([434.  , 464.  , 468.5 , 470.  , 481.84, 484.67, 486.42, 488.01,
       490.83, 493.87, 488.85, 482.88, 481.34, 483.49, 483.74, 484.02,
       485.25, 482.23, 696.  , 714.  , 734.  , 878.5 , 825.5 , 761.5 ,
       599.  , 606.5 , 610.5 , 610.  , 710.  , 735.  , 785.  , 810.  ,
       825.  , 850.5 , 875.5 , 900.5 , 915.5 , 434.5 , 440.5 , 442.5 ,
       446.5 , 473.  , 477.5 , 481.5 , 483.  , 493.55, 496.26, 498.02,
       499.51, 502.4 , 505.34, 500.9 , 494.99, 493.53, 495.61, 495.86,
       496.14, 494.35, 497.37, 681.5 , 695.  , 858.5 , 805.5 , 744.  ,
       581.5 , 593.  , 594.  , 694.  , 719.  , 769.  , 794.  , 809.  ,
       834.5 , 859.5 , 884.5 , 899.5 , 448.5 , 475.  , 479.5 , 483.5 ,
       485.  , 496.65, 499.48, 501.25, 502.79, 505.64, 508.7 , 504.12,
       498.09, 496.57, 498.75, 499.  , 499.29, 500.52, 497.47, 706.  ,
       725.5 , 747.  , 891.5 , 838.5 , 774.5 , 612.  , 616.  , 620.5 ,
       720.5 , 745.5 , 795.5 , 820.  , 835.5 , 861.  , 886.  , 911.  ,
       926.  , 470.5 , 474.5 , 488.  ,  60.  , 485.5 , 487.  , 482.  ,
       491.31, 494.1 , 495.87, 497.36, 500.11, 503.11, 498.57, 492.66,
       491.19, 493.32, 493.57, 493.86, 495.09, 492.04, 651.  , 665.  ,
       684.5 , 829.  , 776.  , 714.5 , 552.  , 590.5 , 910.5 ])

In [13]:
data['rate'].dtype

dtype('float64')

In [14]:
data['date'].str.isnumeric()

0      False
1      False
2      False
3      False
4      False
       ...
163    False
164    False
165    False
166    False
167    False
Name: date, Length: 168, dtype: bool

In [15]:
std_x = data.rate.std()
std_x

164.63791042661944

In [16]:
Year = data['date'].apply(lambda x : x.split(' ')[0])
data.insert(1,"Year",Year)
data.drop(['date'],axis=1,inplace=True)
data.head()

      city        Year    rate
0  Chennai  2017-06-01  434.00
1  Chennai  2017-08-01  464.00
2  Chennai  2017-09-01  468.50
3  Chennai  2017-10-01  470.00
4  Chennai  2018-06-01  481.84